protocolli/modipa/testsuite/src/test/soap/non-bloccante/pull/richiesta-stato-no-correlation.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
    </soap:Header>
    <soap:Body>
        <ns2:MProcessingStatus xmlns:ns2="http://amministrazioneesempio.it/nomeinterfacciaservizio"/>
    </soap:Body>
</soap:Envelope>